window.HARDWARE_QUIZ_DATA = [
  {
    "paper": "ハードウェア",
    "questions": [
      {
        "no": "問01",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "演算機能は制御機能からの指示で演算処理を行う。"
          },
          {
            "key": "イ",
            "text": "演算機能は制御機能，入力機能及び出力機能とデータの受渡しを行う。"
          },
          {
            "key": "ウ",
            "text": "記憶機能は演算機能に対して演算を依頼して結果を保持する。"
          },
          {
            "key": "エ",
            "text": "記憶機能は出力機能に対して記憶機能のデータを出力するように依頼を出す。"
          }
        ],
        "text": "コンピュータを構成する一部の機能の説明として，適切なものはどれか。"
      },
      {
        "no": "問02",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "プロセッサ"
          },
          {
            "key": "イ",
            "text": "キーボード"
          },
          {
            "key": "ウ",
            "text": "プリンター"
          },
          {
            "key": "エ",
            "text": "メモリ"
          }
        ],
        "text": "記憶装置はどれか？"
      },
      {
        "no": "問03",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "1001"
          },
          {
            "key": "イ",
            "text": "0010"
          },
          {
            "key": "ウ",
            "text": "0111"
          },
          {
            "key": "エ",
            "text": "0101"
          }
        ],
        "text": "10 進数である 7 を 2 進数であらわしたものは、次のうちどれか"
      },
      {
        "no": "問04",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "00003321"
          },
          {
            "key": "イ",
            "text": "00011010"
          },
          {
            "key": "ウ",
            "text": "00001233"
          },
          {
            "key": "エ",
            "text": "01101111"
          }
        ],
        "text": "10 進数の 111 を 8 桁の 4 進数として表したものはどれか。"
      },
      {
        "no": "問05",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "8"
          },
          {
            "key": "イ",
            "text": "9"
          },
          {
            "key": "ウ",
            "text": "10"
          },
          {
            "key": "エ",
            "text": "7"
          }
        ],
        "text": "2 進数である「1010」を 10 進数であらわしたものは、次のうちどれか"
      },
      {
        "no": "問06",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "0.1011"
          },
          {
            "key": "イ",
            "text": "0.1001"
          },
          {
            "key": "ウ",
            "text": "0.1101"
          },
          {
            "key": "エ",
            "text": "0.1111"
          }
        ],
        "text": "10 進数の 0.68751 を 2 進数で表したものはどれか。"
      },
      {
        "no": "問07",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "制御装置や演算装置が内蔵されたチップである。"
          },
          {
            "key": "イ",
            "text": "命令やデータを保存している場所を指定するための番号である。"
          },
          {
            "key": "ウ",
            "text": "プロセッサ、主記憶装置、補助記憶装置の間でデータを流すための回線である。"
          },
          {
            "key": "エ",
            "text": "主記憶から取り出した命令やデータを一時的に保存しておくところ。"
          }
        ],
        "text": "コンピュータ内部のバスについて正しい説明はどれか？"
      },
      {
        "no": "問08",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "アドレス方式"
          },
          {
            "key": "イ",
            "text": "仮想記憶方式"
          },
          {
            "key": "ウ",
            "text": "直接プログラム制御方式"
          },
          {
            "key": "エ",
            "text": "プログラム記憶方式"
          }
        ],
        "text": "プログラムを主記憶に読み込んでおき，CPU が順次読み出し実行する方式はどれか。"
      },
      {
        "no": "問09",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "多くのパソコンで用いられており，モデムや周辺装置との間でデータを直列に転送するための規格である。"
          },
          {
            "key": "イ",
            "text": "入出力装置と主記憶との間のデータ転送を CPU と独立に行う機構である。"
          },
          {
            "key": "ウ",
            "text": "バックプレーンや拡張スロットで使用されており，複数の装置が共有するディジタル信号伝送路である。"
          },
          {
            "key": "エ",
            "text": "ハブによるツリー構造の接続ができ，データ転送には高速，低速の二つのモードがある。"
          }
        ],
        "text": "システムバスの説明として，適切なものはどれか。"
      },
      {
        "no": "問10",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "オペランド読出し → 命令の解読 → 命令フェッチ → 命令の実行"
          },
          {
            "key": "イ",
            "text": "オペランド読出し → 命令フェッチ → 命令の解読 → 命令の実行"
          },
          {
            "key": "ウ",
            "text": "命令の解読 → 命令フェッチ → オペランド読出し → 命令の実行"
          },
          {
            "key": "エ",
            "text": "命令フェッチ → 命令の解読 → オペランド読出し → 命令の実行"
          }
        ],
        "text": "コンピュータの命令実行順序として，適切なものはどれか。"
      },
      {
        "no": "問11",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "演算を行うために，メモリから読み出したデータを保持する。"
          },
          {
            "key": "イ",
            "text": "条件付き分岐命令を実行するために，演算結果の状態を保持する。"
          },
          {
            "key": "ウ",
            "text": "命令のデコードを行うために，メモリから読み出した命令を保持する。"
          },
          {
            "key": "エ",
            "text": "命令を読み出すために，次の命令が格納されたアドレスを保持する。"
          }
        ],
        "text": "CPU のプログラムレジスタ（プログラムカウンタ）の役割はどれか。"
      },
      {
        "no": "問12",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "a：演算装置，b：記憶装置，c：制御装置"
          },
          {
            "key": "イ",
            "text": "a：記憶装置，b：制御装置，c：演算装置"
          },
          {
            "key": "ウ",
            "text": "a：制御装置，b：演算装置，c：記憶装置"
          },
          {
            "key": "エ",
            "text": "a：制御装置，b：記憶装置，c：演算装置"
          }
        ],
        "text": "コンピュータの基本構成を表す図中の a～c に入れるべき適切な字句の組合せはどれか",
        "figure": "<p class=\"figureTitle\">コンピュータの基本構成</p>\n  <div class=\"basicComputerOriginal\">\n    <svg class=\"basicComputerSvg\" viewBox=\"0 0 520 260\" role=\"img\" aria-label=\"コンピュータの基本構成\">\n      <defs>\n        <marker id=\"basicArrow\" viewBox=\"0 0 10 10\" refX=\"8\" refY=\"5\" markerWidth=\"6\" markerHeight=\"6\" orient=\"auto-start-reverse\">\n          <path d=\"M 0 0 L 10 5 L 0 10 z\"></path>\n        </marker>\n      </defs>\n      <rect class=\"unit\" x=\"118\" y=\"22\" width=\"110\" height=\"38\"></rect>\n      <text x=\"173\" y=\"47\" text-anchor=\"middle\">a</text>\n      <rect class=\"unit\" x=\"18\" y=\"112\" width=\"86\" height=\"34\"></rect>\n      <text x=\"61\" y=\"135\" text-anchor=\"middle\">入力装置</text>\n      <rect class=\"unit\" x=\"118\" y=\"112\" width=\"110\" height=\"38\"></rect>\n      <text x=\"173\" y=\"137\" text-anchor=\"middle\">b</text>\n      <rect class=\"unit\" x=\"118\" y=\"198\" width=\"110\" height=\"38\"></rect>\n      <text x=\"173\" y=\"223\" text-anchor=\"middle\">c</text>\n      <rect class=\"unit\" x=\"318\" y=\"112\" width=\"86\" height=\"34\"></rect>\n      <text x=\"361\" y=\"135\" text-anchor=\"middle\">出力装置</text>\n      <path class=\"data\" d=\"M104 129 H118\"></path>\n      <path class=\"data\" d=\"M173 112 V62\"></path>\n      <path class=\"data\" d=\"M173 150 V196\"></path>\n      <path class=\"data\" d=\"M228 129 H318\"></path>\n      <path class=\"control\" d=\"M173 62 V91 H61 V111\"></path>\n      <path class=\"control\" d=\"M228 41 H426 V129 H405\"></path>\n      <path class=\"control\" d=\"M173 62 V91 H250 V129 H229\"></path>\n      <path class=\"control\" d=\"M173 62 V91 H84 V217 H117\"></path>\n      <g class=\"legendSvg\">\n        <path class=\"data\" d=\"M330 190 H380\"></path>\n        <text x=\"394\" y=\"195\">：データの流れ</text>\n        <path class=\"control\" d=\"M330 222 H380\"></path>\n        <text x=\"394\" y=\"227\">：制御の流れ</text>\n      </g>\n    </svg>\n  </div>\n  <table class=\"dataTable compactTable\">\n    <tr><th></th><th>a</th><th>b</th><th>c</th></tr>\n    <tr><td>ア</td><td>演算装置</td><td>記憶装置</td><td>制御装置</td></tr>\n    <tr><td>イ</td><td>記憶装置</td><td>制御装置</td><td>演算装置</td></tr>\n    <tr><td>ウ</td><td>制御装置</td><td>演算装置</td><td>記憶装置</td></tr>\n    <tr><td>エ</td><td>制御装置</td><td>記憶装置</td><td>演算装置</td></tr>\n  </table>"
      },
      {
        "no": "問13",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "オペランドの個数は，その命令で指定する主記憶の番地の個数と等しい。"
          },
          {
            "key": "イ",
            "text": "一つのコンピュータでは，命令語長はすべて等しい。"
          },
          {
            "key": "ウ",
            "text": "命令語長が長いコンピュータほど，命令の種類も多くなる。"
          },
          {
            "key": "エ",
            "text": "命令の種類によっては，オペランドがないものもある。"
          }
        ],
        "text": "命令語に関する記述のうち，適切なものはどれか。"
      },
      {
        "no": "問14",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "実効アドレス計算"
          },
          {
            "key": "イ",
            "text": "入出力装置起動"
          },
          {
            "key": "ウ",
            "text": "分岐アドレス計算"
          },
          {
            "key": "エ",
            "text": "割込み発生"
          }
        ],
        "text": "主記憶へのアクセスを伴う演算命令を実行するとき，命令解読とオペランド読出しの間に行われる動作はどれか。"
      },
      {
        "no": "問15",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "アキュムレータ"
          },
          {
            "key": "イ",
            "text": "加算器"
          },
          {
            "key": "ウ",
            "text": "補数器"
          },
          {
            "key": "エ",
            "text": "命令デコーダ"
          }
        ],
        "text": "プロセッサは演算機構及び制御機構からなる。制御機構に分類されるものはどれか。"
      },
      {
        "no": "問16",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "プログラムをハードウェアの配線を組み替える方式"
          },
          {
            "key": "イ",
            "text": "プログラムを記憶装置に格納して、それを 1 行ずつ実行する方式。"
          },
          {
            "key": "ウ",
            "text": "脳の神経回路をモデルとした並列処理技術"
          },
          {
            "key": "エ",
            "text": "脳の神経回路をモデルとした並列処理技術"
          }
        ],
        "text": "ノイマン型コンピュータの説明として正しいものはどれえか？"
      },
      {
        "no": "問17",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "ALU"
          },
          {
            "key": "イ",
            "text": "アキュムレータ"
          },
          {
            "key": "ウ",
            "text": "命令デコーダ"
          },
          {
            "key": "エ",
            "text": "メモリアドレスレジスタ"
          }
        ],
        "text": "プロセッサの制御機構に分類されるものはどれか。"
      },
      {
        "no": "問18",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "20"
          },
          {
            "key": "イ",
            "text": "21"
          },
          {
            "key": "ウ",
            "text": "24"
          },
          {
            "key": "エ",
            "text": "25"
          }
        ],
        "text": "すべての命令が 5 サイクルで完了するように設計されたパイプライン制御のコンピュータがある。20 命令を実行するには何サイクル必要となるか。ここで，すべての命令は途中で停止することなく実行できるものとする。"
      },
      {
        "no": "問19",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "サブルーチンの数をできるだけ多くする。"
          },
          {
            "key": "イ",
            "text": "条件によって実行する文が変わる CASE 文を多くする。"
          },
          {
            "key": "ウ",
            "text": "分岐命令を少なくする。"
          },
          {
            "key": "エ",
            "text": "メモリアクセス命令を少なくする。"
          }
        ],
        "text": "CPU のパイプライン処理を有効に機能させるプログラミング方法はどれか。"
      },
      {
        "no": "問20",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "複数の命令を同時に実行するために，コンパイラが目的プログラムを生成する段階で，それぞれの命令がどの演算器を使うかをあらかじめ割り振る。"
          },
          {
            "key": "イ",
            "text": "命令が実行される段階で，どの演算器を使うかを動的に決めながら，複数の命令を同時に実行する。"
          },
          {
            "key": "ウ",
            "text": "命令の処理をプロセッサ内で複数のステージに細分化し，複数の命令を並列に実行する。"
          },
          {
            "key": "エ",
            "text": "命令を更に細かなマイクロ命令の組合せで実行する。"
          }
        ],
        "text": "パイプライン制御の特徴はどれか。"
      },
      {
        "no": "問21",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "a：GPU，b：暗号化"
          },
          {
            "key": "イ",
            "text": "a：GPU，b：画像"
          },
          {
            "key": "ウ",
            "text": "a：VGA，b：暗号化"
          },
          {
            "key": "エ",
            "text": "a：VGA，b：画像"
          }
        ],
        "text": "プロセッサに関する次の記述中の a，b に入れる字句の適切な組合せはどれか。 【 a 】は【 b 】処理用に開発されたプロセッサである。CPU に内蔵されている場合も多いが，より高度な【 b 】処理を行う場合には，高性能な【 a 】を搭載した拡張ボードを用いることもある。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th></th><th>a</th><th>b</th></tr>\n    <tr><td>ア</td><td>GPU</td><td>暗号化</td></tr>\n    <tr><td>イ</td><td>GPU</td><td>画像</td></tr>\n    <tr><td>ウ</td><td>VGA</td><td>暗号化</td></tr>\n    <tr><td>エ</td><td>VGA</td><td>画像</td></tr>\n  </table>"
      },
      {
        "no": "問22",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "命令長：固定，ハードウェアの制御：主にマイクロコード制御，演算の対象：メモリ，レジスタ"
          },
          {
            "key": "イ",
            "text": "命令長：固定，ハードウェアの制御：ワイヤードロジック型制御，演算の対象：レジスタ"
          },
          {
            "key": "ウ",
            "text": "命令長：可変，ハードウェアの制御：主にマイクロコード制御，演算の対象：レジスタ"
          },
          {
            "key": "エ",
            "text": "命令長：可変，ハードウェアの制御：ワイヤードロジック型制御，演算の対象：メモリ，レジスタ"
          }
        ],
        "text": "CISC と比較したときの RISC の特徴として，適切なものはどれか。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th></th><th>命令長</th><th>ハードウェアの制御</th><th>演算の対象</th></tr>\n    <tr><td>ア</td><td>固定</td><td>主にマイクロコード制御</td><td>メモリ，レジスタ</td></tr>\n    <tr><td>イ</td><td>固定</td><td>ワイヤードロジック型制御</td><td>レジスタ</td></tr>\n    <tr><td>ウ</td><td>可変</td><td>主にマイクロコード制御</td><td>レジスタ</td></tr>\n    <tr><td>エ</td><td>可変</td><td>ワイヤードロジック型制御</td><td>メモリ，レジスタ</td></tr>\n  </table>"
      },
      {
        "no": "問23",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "図ア"
          },
          {
            "key": "イ",
            "text": "図イ"
          },
          {
            "key": "ウ",
            "text": "図ウ"
          },
          {
            "key": "エ",
            "text": "図エ"
          }
        ],
        "text": "次の図のうち，パイプライン制御の説明として適切なものはどれか。ここで，図中の各記号の意味は次のとおりである。 F：命令呼出し，D：解読，A：アドレス計算，R：オペランド呼出し，E：実行",
        "figure": "<p class=\"figureTitle\">F：命令呼出し，D：解読，A：アドレス計算，R：オペランド呼出し，E：実行</p>\n  <div class=\"pipelineChoices\">\n    <div><b>ア</b><div class=\"pipeRows\"><span>命令1</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令2</span><i style=\"--c:7\">F</i><i style=\"--c:8\">D</i><i style=\"--c:9\">A</i><i style=\"--c:10\">R</i><i style=\"--c:11\">E</i><span>命令3</span><i style=\"--c:12\">F</i><i style=\"--c:13\">D</i><i style=\"--c:14\">A</i><i style=\"--c:15\">R</i><i style=\"--c:16\">E</i></div></div>\n    <div><b>イ</b><div class=\"pipeRows\"><span>命令1</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令2</span><i style=\"--c:5\">F</i><i style=\"--c:6\">D</i><i style=\"--c:7\">A</i><i style=\"--c:8\">R</i><i style=\"--c:9\">E</i><span>命令3</span><i style=\"--c:8\">F</i><i style=\"--c:9\">D</i><i style=\"--c:10\">A</i><i style=\"--c:11\">R</i><i style=\"--c:12\">E</i></div></div>\n    <div><b>ウ</b><div class=\"pipeRows\"><span>命令1</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令2</span><i style=\"--c:3\">F</i><i style=\"--c:4\">D</i><i style=\"--c:5\">A</i><i style=\"--c:6\">R</i><i style=\"--c:7\">E</i><span>命令3</span><i style=\"--c:4\">F</i><i style=\"--c:5\">D</i><i style=\"--c:6\">A</i><i style=\"--c:7\">R</i><i style=\"--c:8\">E</i></div></div>\n    <div><b>エ</b><div class=\"pipeRows\"><span>命令1</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令2</span><i style=\"--c:2\">F</i><i style=\"--c:3\">D</i><i style=\"--c:4\">A</i><i style=\"--c:5\">R</i><i style=\"--c:6\">E</i><span>命令3</span><i style=\"--c:3\">F</i><i style=\"--c:4\">D</i><i style=\"--c:5\">A</i><i style=\"--c:6\">R</i><i style=\"--c:7\">E</i></div></div>\n  </div>"
      },
      {
        "no": "問24",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "AR"
          },
          {
            "key": "イ",
            "text": "DVI"
          },
          {
            "key": "ウ",
            "text": "GPU"
          },
          {
            "key": "エ",
            "text": "MPEG"
          }
        ],
        "text": "PC やスマートフォンなどの表示画面の画像処理用のチップとして用いられているほか， AI における膨大な計算処理にも利用されているものはどれか。"
      },
      {
        "no": "問25",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "32 ビットCPU と64 ビット CPU では，64 ビット CPU の方が一度に処理するデータ長を大きくできる。"
          },
          {
            "key": "イ",
            "text": "CPU 内のキャッシュメモリの容量は，少ないほど CPU の処理速度が向上する。"
          },
          {
            "key": "ウ",
            "text": "同じ構造の CPU において，クロック周波数を下げると処理速度が向上する。"
          },
          {
            "key": "エ",
            "text": "デュアルコア CPU とクアッドコア CPU では，デュアルコア CPU の方が同時に実行する処理の数を多くできる。"
          }
        ],
        "text": "CPU の性能に関する記述のうち，適切なものはどれか。"
      },
      {
        "no": "問26",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "34"
          },
          {
            "key": "イ",
            "text": "100"
          },
          {
            "key": "ウ",
            "text": "125"
          },
          {
            "key": "エ",
            "text": "133"
          }
        ],
        "text": "クロック周波数が 1 GHz の CPU がある。この CPU の命令種別が，表に示す二つから成っているとき，処理能力は約何 MIPS か。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th>命令種別</th><th>実行時間（クロック）</th><th>実行頻度（%）</th></tr>\n    <tr><td>命令1</td><td>10</td><td>60</td></tr>\n    <tr><td>命令2</td><td>5</td><td>40</td></tr>\n  </table>"
      },
      {
        "no": "問27",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "単一の命令を基に，複数のデータに対して複数のプロセッサが同期をとりながら並列にそれぞれのデータを処理する方式"
          },
          {
            "key": "イ",
            "text": "一つのプロセッサにおいて，単一の命令に対する実行時間をできるだけ短くする方式"
          },
          {
            "key": "ウ",
            "text": "一つのプロセッサにおいて，複数の命令を少しずつ段階をずらしながら同時実行する方式"
          },
          {
            "key": "エ",
            "text": "複数のプロセッサが，それぞれ独自の命令を基に複数のデータを処理する方式"
          }
        ],
        "text": "プロセッサにおけるパイプライン処理方式を説明したものはどれか。"
      },
      {
        "no": "問28",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "USB 接続された周辺機器と CPU の間のデータ転送速度は，クロックの周波数によって決まる。"
          },
          {
            "key": "イ",
            "text": "クロックの間隔が短いほど命令実行に時間が掛かる。"
          },
          {
            "key": "ウ",
            "text": "クロックは，次に実行すべき命令の格納位置を記録する。"
          },
          {
            "key": "エ",
            "text": "クロックは，命令実行のタイミングを調整する。"
          }
        ],
        "text": "CPU のクロックに関する説明のうち，適切なものはどれか。"
      },
      {
        "no": "問29",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "処理すべきベクトルの長さがベクトルレジスタより長い場合，ベクトルレジスタ長の組に分割して処理を繰り返す方式である。"
          },
          {
            "key": "イ",
            "text": "パイプラインを更に細分化することによって高速化を図る方式である。"
          },
          {
            "key": "ウ",
            "text": "複数のパイプラインを用いて，同時に複数の命令を実行可能にすることによって高速化を図る方式である。"
          },
          {
            "key": "エ",
            "text": "命令語を長く取り，一つの命令で複数の機能ユニットを同時に制御することによって高速化を図る方式である。"
          }
        ],
        "text": "スーパスカラの説明はどれか。"
      },
      {
        "no": "問30",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "5"
          },
          {
            "key": "イ",
            "text": "10"
          },
          {
            "key": "ウ",
            "text": "20"
          },
          {
            "key": "エ",
            "text": "50"
          }
        ],
        "text": "平均命令実行時間が20 ナノ秒のコンピュータがある。このコンピュータの性能は何MIPS か。"
      },
      {
        "no": "問31",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "20 ナノ秒"
          },
          {
            "key": "イ",
            "text": "50 ナノ秒"
          },
          {
            "key": "ウ",
            "text": "2 マイクロ秒"
          },
          {
            "key": "エ",
            "text": "5 マイクロ秒"
          }
        ],
        "text": "50 MIPS のプロセッサの平均命令実行時間は幾らか。"
      },
      {
        "no": "問32",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "インデックスレジスタ"
          },
          {
            "key": "イ",
            "text": "汎用レジスタ"
          },
          {
            "key": "ウ",
            "text": "プログラムカウンタ"
          },
          {
            "key": "エ",
            "text": "命令レジスタ"
          }
        ],
        "text": "処理装置を構成する要素のうち，分岐命令の実行によって更新されるものはどれか。"
      },
      {
        "no": "問33",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "間接アドレス指定"
          },
          {
            "key": "イ",
            "text": "指標アドレス指定"
          },
          {
            "key": "ウ",
            "text": "相対アドレス指定"
          },
          {
            "key": "エ",
            "text": "直接アドレス指定"
          }
        ],
        "text": "主記憶のデータを図のように参照するアドレス指定方式はどれか。",
        "figure": "<p class=\"figureTitle\">アドレス部 20 が主記憶 20 番地を参照し，その内容 25 をさらにアドレスとして参照する。</p>\n  <div class=\"addressFigure\">\n    <div class=\"instructionBox\"><span>命令部</span><span>アドレス部<br><b>20</b></span></div>\n    <div class=\"arrowLine\">→</div>\n    <table class=\"memoryTable\"><tr><th>アドレス</th><th>主記憶</th></tr><tr><td>20</td><td>25</td></tr><tr><td>25</td><td>データ</td></tr></table>\n  </div>"
      },
      {
        "no": "問34",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "1201"
          },
          {
            "key": "イ",
            "text": "1300"
          },
          {
            "key": "ウ",
            "text": "2200"
          },
          {
            "key": "エ",
            "text": "2300"
          }
        ],
        "text": "“LOAD GR, B, AD”は，AD が示す番地にベースレジスタ B の内容を加えた値を有効アドレスとして，その有効アドレスが示す主記憶に格納されているデータを汎用レジスタ GR にロ ードする命令である。図の状態で，次の命令を実行したとき，汎用レジスタ GR にロードされるデータはどれか。 LOAD GR, 1, 200",
        "figure": "<p class=\"figureTitle\">ベースレジスタ1 = 100，命令：LOAD GR, 1, 200</p>\n  <div class=\"addressFigure\">\n    <table class=\"dataTable compactTable\"><tr><th>番地</th><th>主記憶</th></tr><tr><td>100</td><td>1100</td></tr><tr><td>101</td><td>1101</td></tr><tr><td>200</td><td>1200</td></tr><tr><td>201</td><td>1201</td></tr><tr><td>300</td><td>1300</td></tr><tr><td>301</td><td>1301</td></tr><tr><td>1200</td><td>2200</td></tr><tr><td>1201</td><td>2201</td></tr><tr><td>1300</td><td>2300</td></tr><tr><td>1301</td><td>2301</td></tr></table>\n  </div>"
      },
      {
        "no": "問35",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "指標付きアドレス指定方式"
          },
          {
            "key": "イ",
            "text": "相対アドレス指定方式"
          },
          {
            "key": "ウ",
            "text": "直接アドレス指定方式"
          },
          {
            "key": "エ",
            "text": "間接アドレス指定方式"
          }
        ],
        "text": "図に示すアドレス指定方式はどれか。",
        "figure": "<p class=\"figureTitle\">レジスタ番号 2 の内容 50 とアドレス定数 100 を加え，150 番地を参照する。</p>\n  <div class=\"addressFigure\">\n    <div class=\"instructionBox three\"><span>命令部</span><span>レジスタ番号<br><b>2</b></span><span>アドレス定数<br><b>100</b></span></div>\n    <table class=\"dataTable compactTable\"><tr><th>レジスタ番号</th><th>値</th></tr><tr><td>0</td><td></td></tr><tr><td>1</td><td></td></tr><tr><td>2</td><td>50</td></tr><tr><td>3</td><td></td></tr></table>\n    <table class=\"dataTable compactTable\"><tr><th>主記憶アドレス</th><th>内容</th></tr><tr><td>150番地</td><td>処理対象データ</td></tr></table>\n  </div>"
      },
      {
        "no": "問36",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "間接アドレス"
          },
          {
            "key": "イ",
            "text": "指標付きアドレス"
          },
          {
            "key": "ウ",
            "text": "即値オペランド"
          },
          {
            "key": "エ",
            "text": "直接アドレス"
          }
        ],
        "text": "アドレス指定方式のうち，命令読出し後のメモリ参照を行わずにデータを取り出すものはどれか。"
      },
      {
        "no": "問37",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "110"
          },
          {
            "key": "イ",
            "text": "1010"
          },
          {
            "key": "ウ",
            "text": "1100"
          },
          {
            "key": "エ",
            "text": "1110"
          }
        ],
        "text": "どれか。 インデックス修飾によってオペランドを指定する場合，表に示す値のときの実効アドレスは",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><td class=\"left\">インデックスレジスタの値</td><td>10</td></tr>\n    <tr><td class=\"left\">命令語のアドレス部の値</td><td>100</td></tr>\n    <tr><td class=\"left\">命令が格納されているアドレス</td><td>1000</td></tr>\n  </table>"
      },
      {
        "no": "問38",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "コンデンサに電荷を蓄えた状態か否かによって 1 ビットを表現する。主記憶としてよく用いられる。"
          },
          {
            "key": "イ",
            "text": "製造時にデータが書き込まれる。マイクロプログラム格納用メモリとして用いられる。"
          },
          {
            "key": "ウ",
            "text": "専用の装置でデータを書き込むことができ，紫外線照射で消去ができる。"
          },
          {
            "key": "エ",
            "text": "フリップフロップで構成され，高速であるが製造コストが高い。キャッシュメモリなどに用いられる。"
          }
        ],
        "text": "DRAM の説明として，適切なものはどれか。"
      },
      {
        "no": "問39",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "一定時間ごとに内容を外部記憶装置に書き込む。"
          },
          {
            "key": "イ",
            "text": "システムの電源投入時に，全領域を 0 で初期化する。"
          },
          {
            "key": "ウ",
            "text": "データを保持するために，一定時間ごとにアクセスする。"
          },
          {
            "key": "エ",
            "text": "内容を更新するときに，データを一旦消去する。"
          }
        ],
        "text": "DRAM のリフレッシュ動作の説明として，適切なものはどれか。"
      },
      {
        "no": "問40",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "DRAM"
          },
          {
            "key": "イ",
            "text": "SRAM"
          },
          {
            "key": "ウ",
            "text": "フラッシュメモリ"
          },
          {
            "key": "エ",
            "text": "マスク ROM"
          }
        ],
        "text": "ディジタルカメラの画像データや携帯音楽プレーヤの音楽データの記録媒体として利用されているものはどれか。"
      },
      {
        "no": "問41",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "書込み及び消去を一括又はブロック単位で行う。"
          },
          {
            "key": "イ",
            "text": "データを保持するためのリフレッシュ操作又はアクセス操作が不要である。"
          },
          {
            "key": "ウ",
            "text": "電源が遮断された状態でも，記憶した情報を保持することができる。"
          },
          {
            "key": "エ",
            "text": "メモリセル構造が単純なので高集積化することができ，ビット単価を安くできる。"
          }
        ],
        "text": "DRAM の特徴はどれか。"
      },
      {
        "no": "問42",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "紫外線照射で内容を消去することによって，メモリ部品を再利用することができる。"
          },
          {
            "key": "イ",
            "text": "出荷後のプログラムの不正な書換えを防ぐことができる。"
          },
          {
            "key": "ウ",
            "text": "製品の量産後にシリアル番号などの個体識別データを書き込むことができる。"
          },
          {
            "key": "エ",
            "text": "動作中に主記憶が不足した場合，補助記憶として使用することができる。"
          }
        ],
        "text": "組込みシステムのプログラムを格納するメモリとして，マスク ROM を使用するメリットはどれか。"
      },
      {
        "no": "問43",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "高速に書換えができ，CPU のキャッシュメモリなどに用いられる。 SRAM の説明"
          },
          {
            "key": "イ",
            "text": "紫外線で全内容の消去ができる。"
          },
          {
            "key": "ウ",
            "text": "周期的にデータの再書込みが必要である。"
          },
          {
            "key": "エ",
            "text": "ブロック単位で電気的に消去できる。"
          }
        ],
        "text": "フラッシュメモリに関する記述として，適切なものはどれか。"
      },
      {
        "no": "問44",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "AND ゲート"
          },
          {
            "key": "イ",
            "text": "加算器"
          },
          {
            "key": "ウ",
            "text": "キャパシタ"
          },
          {
            "key": "エ",
            "text": "フリップフロップ"
          }
        ],
        "text": "二つの安定状態をもつ回路で，SRAM の記憶セルに使用される順序回路の基本構成要素はどれか。"
      },
      {
        "no": "問45",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "DRAM"
          },
          {
            "key": "イ",
            "text": "RDRAM"
          },
          {
            "key": "ウ",
            "text": "SDRAM"
          },
          {
            "key": "エ",
            "text": "SRAM"
          }
        ],
        "text": "フリップフロップ回路を利用した高速なメモリはどれか。"
      },
      {
        "no": "問46",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "キャッシュメモリ：10ナノ秒，ヒット率：60%，主記憶：70ナノ秒"
          },
          {
            "key": "イ",
            "text": "キャッシュメモリ：10ナノ秒，ヒット率：70%，主記憶：70ナノ秒"
          },
          {
            "key": "ウ",
            "text": "キャッシュメモリ：20ナノ秒，ヒット率：70%，主記憶：50ナノ秒"
          },
          {
            "key": "エ",
            "text": "キャッシュメモリ：20ナノ秒，ヒット率：80%，主記憶：50ナノ秒"
          }
        ],
        "text": "キャッシュメモリと主記憶に関するアクセス時間とヒット率の組合せのうち，主記憶の実効アクセス時間が最も短くなるのはどれか。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th></th><th colspan=\"2\">キャッシュメモリ</th><th>主記憶</th></tr>\n    <tr><th></th><th>アクセス時間（ナノ秒）</th><th>ヒット率（%）</th><th>アクセス時間（ナノ秒）</th></tr>\n    <tr><td>ア</td><td>10</td><td>60</td><td>70</td></tr>\n    <tr><td>イ</td><td>10</td><td>70</td><td>70</td></tr>\n    <tr><td>ウ</td><td>20</td><td>70</td><td>50</td></tr>\n    <tr><td>エ</td><td>20</td><td>80</td><td>50</td></tr>\n  </table>"
      },
      {
        "no": "問47",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "0.75"
          },
          {
            "key": "イ",
            "text": "0.90"
          },
          {
            "key": "ウ",
            "text": "0.95"
          },
          {
            "key": "エ",
            "text": "0.96"
          }
        ],
        "text": "図に示す構成で，表に示すようにキャッシュメモリと主記憶のアクセス時間だけが異なり， ほかの条件は同じ 2 種類の CPU X と Y がある。 あるプログラムを CPU X と Y でそれぞれ実行したところ，両者の処理時間が等しかった。このとき，キャッシュメモリのヒット率は幾らか。ここで，CPU 処理以外の影響はないものとする。",
        "figure": "<div class=\"cacheLayout\"><div class=\"cacheBox\"><div>CPU</div><div>キャッシュメモリ<br>256Kバイト</div></div><div class=\"cacheBox\">主記憶<br>256Mバイト</div></div>\n  <table class=\"dataTable compactTable\">\n    <tr><th>アクセス時間<br>単位 ナノ秒</th><th>CPU X</th><th>CPU Y</th></tr>\n    <tr><td>キャッシュメモリ</td><td>40</td><td>20</td></tr>\n    <tr><td>主記憶</td><td>400</td><td>580</td></tr>\n  </table>"
      },
      {
        "no": "問48",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "書込み命令を実行したときに，キャッシュメモリと主記憶の両方を書き換える方式と，キャッシュメモリだけを書き換えておき，主記憶の書換えはキャッシュメモリから当該データが追い出されるときに行う方式とがある。"
          },
          {
            "key": "イ",
            "text": "キャッシュメモリにヒットしない場合に割込みが生じ，プログラムによって主記憶からキャッシュメモリにデータが転送される。"
          },
          {
            "key": "ウ",
            "text": "キャッシュメモリは，実記憶と仮想記憶とのメモリ容量の差を埋めるために採用される。"
          },
          {
            "key": "エ",
            "text": "半導体メモリのアクセス速度の向上が著しいので，キャッシュメモリの必要性は減っている。"
          }
        ],
        "text": "キャッシュメモリに関する記述のうち，適切なものはどれか。"
      },
      {
        "no": "問49",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "キャッシュメモリから所要のデータをブロック転送し，磁気ディスクに書き込む。"
          },
          {
            "key": "イ",
            "text": "磁気ディスクから所要のデータをブロック転送し，キャッシュメモリに読み込む。"
          },
          {
            "key": "ウ",
            "text": "主記憶から所要のデータをブロック転送し，キャッシュメモリに読み込む。"
          },
          {
            "key": "エ",
            "text": "ディスクキャッシュから所要のデータをブロック転送し，主記憶に読み込む。"
          }
        ],
        "text": "プロセッサにデータを読み込む時にキャッシュメモリにヒットしなかった場合， キャッシュメモリ制御装置が行う動作はどれか。"
      },
      {
        "no": "問50",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "CPU から主記憶へのアクセスを高速化するために，キャッシュメモリと主記憶との両方に同時にデータを書き込む。"
          },
          {
            "key": "イ",
            "text": "CPU から主記憶へのアクセスを高速化するために，主記憶内部を複数のバンクに分割し， 各バンクを並列にアクセスする。"
          },
          {
            "key": "ウ",
            "text": "CPU と主記憶のアクセス速度の違いによるボトルネックを解消するために，高速かつ小容量のメモリを配置する。"
          },
          {
            "key": "エ",
            "text": "パイプライン処理を乱す要因をなくすために，キャッシュメモリを命令用とデータ用の二つに分離する。"
          }
        ],
        "text": "メモリインタリーブの説明として，適切なものはどれか。"
      },
      {
        "no": "問51",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "0.2"
          },
          {
            "key": "イ",
            "text": "0.3"
          },
          {
            "key": "ウ",
            "text": "0.5"
          },
          {
            "key": "エ",
            "text": "0.8"
          }
        ],
        "text": "システム A，B のキャッシュメモリと主記憶のアクセス時間は，表のとおりである。あるプログラムをシステム A で実行したときのキャッシュメモリのヒット率と実効アクセス時間は，システム B で実行したときと同じになった。このときのキャッシュメモリのヒット率は幾らか。",
        "figure": "<table class=\"dataTable compactTable\">\n    <tr><th>単位 ナノ秒</th><th>システムA</th><th>システムB</th></tr>\n    <tr><td>キャッシュメモリ</td><td>15</td><td>10</td></tr>\n    <tr><td>主記憶</td><td>50</td><td>70</td></tr>\n  </table>"
      },
      {
        "no": "問52",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "0.1"
          },
          {
            "key": "イ",
            "text": "0.17"
          },
          {
            "key": "ウ",
            "text": "0.83"
          },
          {
            "key": "エ",
            "text": "0.9"
          }
        ],
        "text": "主記憶のアクセス時間 60 ナノ秒，キャッシュメモリのアクセス時間 10 ナノ秒のシステムがある。キャッシュメモリを介して主記憶にアクセスする場合の実効アクセス時間が 15 ナノ秒であるとき，キャッシュメモリのヒット率は幾らか。"
      },
      {
        "no": "問53",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "CPU と磁気ディスク装置との間に半導体メモリによるデータバッファを設けて，磁気ディスクアクセスの高速化を図る。"
          },
          {
            "key": "イ",
            "text": "主記憶のデータの一部をキャッシュメモリにコピーすることによって， CPU と主記憶とのアクセス速度のギャップを埋め，メモリアクセスの高速化を図る。"
          },
          {
            "key": "ウ",
            "text": "主記憶へのアクセスを高速化するため，アクセス要求，データの読み書き及び後処理が終わってから，次のメモリアクセスの処理に移る。"
          },
          {
            "key": "エ",
            "text": "主記憶を複数の独立したグループに分けて，各グループに交互にアクセスすることによって，主記憶へのアクセスの高速化を図る。"
          }
        ],
        "text": "メモリインタリーブの説明はどれか。"
      },
      {
        "no": "問54",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "取り出し：演算、解釈：制御"
          },
          {
            "key": "イ",
            "text": "取り出し：記憶、解釈：制御"
          },
          {
            "key": "ウ",
            "text": "取り出し：制御、解釈：演算"
          },
          {
            "key": "エ",
            "text": "取り出し：入力、解釈：演算"
          }
        ],
        "text": "コンピュータは，入力，記憶，演算，制御及び出力の五つの機能を実現する各装置から構成される。命令はどの装置から取り出され，どの装置で解釈されるか。"
      },
      {
        "no": "問55",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "体積が大きく運搬ができないので，保管や再利用には適していない。"
          },
          {
            "key": "イ",
            "text": "大量のデータが記憶できるので，ハードディスクのバックアップなどによく利用される。"
          },
          {
            "key": "ウ",
            "text": "低速ではあるが，ランダムアクセスが可能である。"
          },
          {
            "key": "エ",
            "text": "ビット当たりの価格はハードディスクより高価である。"
          }
        ],
        "text": "磁気テープの特徴に関する記述として，適切なものはどれか"
      },
      {
        "no": "問56",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "磁気ディスクの更新の差分をバックアップする場合は，記録データの部分書換え機能が利用できる。"
          },
          {
            "key": "イ",
            "text": "磁気ディスクの読出し速度に合わせて，書込み時の記録密度を変更できる。"
          },
          {
            "key": "ウ",
            "text": "データの書込み速度を向上させるために，複数の書込みヘッドを使用している。"
          },
          {
            "key": "エ",
            "text": "データの読み書きを連続して行い，ブロックごとにスタート，ストップさせることはしない"
          }
        ],
        "text": "磁気ディスクのバックアップを取るために使用されるストリーマ(テープドライブ)に関する記述のうち，適切なものはどれか。"
      },
      {
        "no": "問57",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "ア"
          },
          {
            "key": "イ",
            "text": "イ"
          },
          {
            "key": "ウ",
            "text": "ウ"
          },
          {
            "key": "エ",
            "text": "エ"
          }
        ],
        "text": "NAS(Network Attached Storage)の構成図として適切なものはどれか。ここで，図の〇はストレージの管理専用のファイルシステムを，二重線はストレージアクセス用のプロトコルを使用する専用ネットワークを意味するものとする。",
        "figure": "<div class=\"imageChoiceGrid\"><div><b>ア</b><img src=\"assets/hardware/figure-13.png\" alt=\"選択肢ア\" loading=\"lazy\"></div><div><b>イ</b><img src=\"assets/hardware/figure-11.png\" alt=\"選択肢イ\" loading=\"lazy\"></div><div><b>ウ</b><img src=\"assets/hardware/figure-04.png\" alt=\"選択肢ウ\" loading=\"lazy\"></div><div><b>エ</b><img src=\"assets/hardware/figure-02.png\" alt=\"選択肢エ\" loading=\"lazy\"></div></div>"
      },
      {
        "no": "問58",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "CD-R"
          },
          {
            "key": "イ",
            "text": "CD-RW"
          },
          {
            "key": "ウ",
            "text": "DVD-RAM"
          },
          {
            "key": "エ",
            "text": "DVD-ROM"
          }
        ],
        "text": "記録媒体の記録層として有機色素を使い，レーザ光によってピットと呼ばれる焦げ跡を作ってデータを記録する光ディスクはどれか。"
      },
      {
        "no": "問59",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "磁化されているディスクの記録膜にレーザ光を当てて熱し，磁気ヘッドで磁化の方向を変化させて記録する。"
          },
          {
            "key": "イ",
            "text": "ディスクに塗布した磁性体の磁化の方向を，磁気ヘッドによって変化させて記録する。"
          },
          {
            "key": "ウ",
            "text": "ディスクをはり合わせた2層構造をもち，レーザ光で記録層を相変化させて記録する。"
          },
          {
            "key": "エ",
            "text": "有機色素が塗られたディスクにレーザ光を当て，有機色素の層にピットと呼ばれる焦げ跡を作って記録する。"
          }
        ],
        "text": "CD-Rのデータ記録方法として，適切なものはどれか。"
      },
      {
        "no": "問60",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "CD-ROM装置では読み出せない。"
          },
          {
            "key": "イ",
            "text": "CD-ROMより大容量のデータが書き込める。"
          },
          {
            "key": "ウ",
            "text": "初期化することによって，再書込みが可能となる。"
          },
          {
            "key": "エ",
            "text": "複数の書込み方式がある。"
          }
        ],
        "text": "CD-Rに関する記述のうち，適切なものはどれか。"
      },
      {
        "no": "問61",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "磁気ヘッドの磁化強度を複数もつ。"
          },
          {
            "key": "イ",
            "text": "磁気ヘッドの磁化方向を複数もつ。"
          },
          {
            "key": "ウ",
            "text": "レーザ光線の光度が強い。"
          },
          {
            "key": "エ",
            "text": "レーザ光線の波長が短い。"
          }
        ],
        "text": "DVDの大容量化を可能にしている理由のうち，適切なものはどれか。"
      },
      {
        "no": "問62",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "GPS，カメラ，無線LANアダプタなどの周辺機能をハードウェアとしてカードに搭載している。"
          },
          {
            "key": "イ",
            "text": "SDメモリカードの4分の1以下の小型サイズで，最大32Gバイトの容量をもつ。"
          },
          {
            "key": "ウ",
            "text": "著作権保護技術としてAACSを採用し，従来のSDメモリカードよりもセキュリティが強化された。"
          },
          {
            "key": "エ",
            "text": "ファイルシステムにexFATを採用し，最大2Tバイトの容量に対応できる。"
          }
        ],
        "text": "SDメモリカードの上位規格の一つであるSDXCの特徴として，適切なものはどれか。"
      },
      {
        "no": "問63",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "アクセス時間は，回転速度を上げるか位置決め時間を短縮すると短くなる。"
          },
          {
            "key": "イ",
            "text": "アクセス時間は，処理装置の前処理時間，データ転送後の後処理時間も含む。"
          },
          {
            "key": "ウ",
            "text": "記憶容量は，トラック当たりの記憶容量と1シリンダ当たりのトラック数だけで決まる。"
          },
          {
            "key": "エ",
            "text": "データ転送速度は，回転速度と回転待ち時間で決まる。"
          }
        ],
        "text": "磁気ディスク装置の性能に関する記述のうち，適切なものはどれか"
      },
      {
        "no": "問64",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "80"
          },
          {
            "key": "イ",
            "text": "120"
          },
          {
            "key": "ウ",
            "text": "160"
          },
          {
            "key": "エ",
            "text": "220"
          }
        ],
        "text": "磁気ディスク装置のヘッドが現在シリンダ番号100にあり，待ち行列にシリンダ番号120，90，70，80，140，110，60への入出力要求が並んでいる。次の条件のとき，ヘッドが移動するシリンダの総数は幾らか。 〔条件〕 (1)入出力要求を並べ替えて，できるだけヘッドを一方向に動かし，シリンダ番号順に処理する，シーク最適化方式である。 (2)現在のヘッドの移動方向は，シリンダ番号が増加する方向にある。 (3)現在のヘッドの移動方向のシリンダに入出力要求がなくなったとき，ヘッドの移動方向を変える。 (4)入出力要求の処理順序を変更しても，処理結果に影響はない。 (5)処理中に新たな入出力要求は発生しない。"
      },
      {
        "no": "問65",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "7"
          },
          {
            "key": "イ",
            "text": "10"
          },
          {
            "key": "ウ",
            "text": "12"
          },
          {
            "key": "エ",
            "text": "14"
          }
        ],
        "text": "回転数が4,200回／分で，平均位置決め時間が5ミリ秒の磁気ディスク装置がある。この磁気ディスク装置の平均待ち時間は約何ミリ秒か。ここで，平均待ち時間は，平均位置決め時間と平均回転待ち時間の合計である。"
      },
      {
        "no": "問66",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "15.1"
          },
          {
            "key": "イ",
            "text": "16.0"
          },
          {
            "key": "ウ",
            "text": "20.1"
          },
          {
            "key": "エ",
            "text": "21.0"
          }
        ],
        "text": "表に示す仕様の磁気ディスク装置において，1,000バイトのデータの読取りに要する平均時間は何ミリ秒か。ここで，コントローラの処理時間は平均シーク時間に含まれるものとする。",
        "figure": "<div class=\"securityFigure\"><img src=\"assets/hardware/figure-05.png\" alt=\"問題図\" loading=\"lazy\"></div>"
      },
      {
        "no": "問67",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "10"
          },
          {
            "key": "イ",
            "text": "16"
          },
          {
            "key": "ウ",
            "text": "19"
          },
          {
            "key": "エ",
            "text": "55"
          }
        ],
        "text": "表の仕様の磁気ディスク装置において，512バイト（1セクタ）のデータの呼出しが終了するまでの平均時間は約何ミリ秒か。",
        "figure": "<div class=\"securityFigure\"><img src=\"assets/hardware/figure-07.png\" alt=\"問題図\" loading=\"lazy\"></div>"
      },
      {
        "no": "問68",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "27.6"
          },
          {
            "key": "イ",
            "text": "29.2"
          },
          {
            "key": "ウ",
            "text": "33.6"
          },
          {
            "key": "エ",
            "text": "35.2"
          }
        ],
        "text": "回転速度が5,000回転／分，平均シーク時間が20ミリ秒の磁気ディスクがある。この磁気ディスクの1トラック当たりの記憶容量は，15,000バイトである。このとき，1ブロックが4,000バイトのデータを，1ブロック転送するために必要な平均アクセス時間は何ミリ秒か。"
      },
      {
        "no": "問69",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "1本のケーブルにマスタとスレーブの2台が接続できる。"
          },
          {
            "key": "イ",
            "text": "内蔵ハードディスク専用の規格である。"
          },
          {
            "key": "ウ",
            "text": "複数のポートを束ねて用いることによって高速化できる。"
          },
          {
            "key": "エ",
            "text": "ポートマルチプライヤを用いてポート数が拡張できる。"
          }
        ],
        "text": "シリアルATAの特徴として，適切なものはどれか。"
      },
      {
        "no": "問70",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "IEEE1394接続コネクタが2口ある工業用カメラを数珠つなぎにし，一端をPCに接続する。"
          },
          {
            "key": "イ",
            "text": "PCと計測機器とをRS-232Cで接続し，PCとプリンタとをUSBを用いて接続する。"
          },
          {
            "key": "ウ",
            "text": "USBハブにキーボード，マウス，プリンタをつなぎ，USBハブとPCとを接続する。"
          },
          {
            "key": "エ",
            "text": "数台のネットワークカメラ及びPCをネットワークハブに接続する。"
          }
        ],
        "text": "デイジーチェーン接続はどれか。"
      },
      {
        "no": "問71",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "PCに内蔵されるCD-ROM装置，DVD装置などを接続するためのパラレルインタフェースである。"
          },
          {
            "key": "イ",
            "text": "磁気ディスク，プリンタなどをデイジーチェーンで接続するパラレルインタフェースである。"
          },
          {
            "key": "ウ",
            "text": "ハブを介してツリー状に機器を接続できるシリアルインタフェースである。"
          },
          {
            "key": "エ",
            "text": "プリンタなどに赤外線を使ってデータを転送するシリアルインタフェースである。"
          }
        ],
        "text": "USBの説明はどれか。"
      },
      {
        "no": "問72",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "1クロックで2ビットの情報を伝送する4対の信号線を使用し，最大1Gビット／秒のスループットを持つインタフェースである。"
          },
          {
            "key": "イ",
            "text": "PCと周辺機器とを接続するATA仕様をシリアル化したものである。"
          },
          {
            "key": "ウ",
            "text": "音声，映像などに適したアイソクロナス転送を採用しており，ブロードキャスト転送モードを持つシリアルインタフェースである。"
          },
          {
            "key": "エ",
            "text": "スーパースピードと呼ばれる5Gビット／秒のデータ転送モードをもつシリアルインタフェースである。"
          }
        ],
        "text": "USB3.0の説明として，適切なものはどれか。"
      },
      {
        "no": "問73",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "アイソクロナス転送"
          },
          {
            "key": "イ",
            "text": "インタラプト転送"
          },
          {
            "key": "ウ",
            "text": "コントロール転送"
          },
          {
            "key": "エ",
            "text": "バルク転送"
          }
        ],
        "text": "USBの転送モードのうち，主としてマウスやジョイスティックなどに用いられるものはどれか。"
      },
      {
        "no": "問74",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "ア"
          },
          {
            "key": "イ",
            "text": "イ"
          },
          {
            "key": "ウ",
            "text": "ウ"
          },
          {
            "key": "エ",
            "text": "エ"
          }
        ],
        "text": "USB Type-Cのプラグ側コネクタの断面図はどれか。ここで，図の縮尺は同一ではない。",
        "figure": "<div class=\"securityFigure\"><img src=\"assets/hardware/figure-01.png\" alt=\"問題図\" loading=\"lazy\"></div>"
      },
      {
        "no": "問75",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "IDE"
          },
          {
            "key": "イ",
            "text": "RS-232C"
          },
          {
            "key": "ウ",
            "text": "SCSI"
          },
          {
            "key": "エ",
            "text": "USB"
          }
        ],
        "text": "多くの周辺機器を，ハブを使ってツリー状に接続できるインタフェース規格はどれか。"
      },
      {
        "no": "問76",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "ハブ同士はクロスケーブルで接続する。"
          },
          {
            "key": "イ",
            "text": "ハブの接続は，コンピュータの電源を入れる前に行う必要がある。"
          },
          {
            "key": "ウ",
            "text": "ハブを経由して，複数のコンピュータ同士を接続することができる。"
          },
          {
            "key": "エ",
            "text": "ハブを利用して，外部機器をハブを含めて最大127台まで接続できる。"
          }
        ],
        "text": "USBハブの説明として，適切なものはどれか。"
      },
      {
        "no": "問77",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "接続形態はデイジーチェーン方式だけである。"
          },
          {
            "key": "イ",
            "text": "接続されている機器ごとのIDの設定やターミネータ（終端抵抗）の接続が必要である。"
          },
          {
            "key": "ウ",
            "text": "接続されている機器の電源をいれたままで抜き差しができる。"
          },
          {
            "key": "エ",
            "text": "パラレルインタフェースである。"
          }
        ],
        "text": "IEEE 1394に関する説明のうち，適切なものはどれか。"
      },
      {
        "no": "問78",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "コンピュータや機器の電源を入れたままでも，機器の着脱が可能である。"
          },
          {
            "key": "イ",
            "text": "最大転送速度が，10Mビット／秒である。"
          },
          {
            "key": "ウ",
            "text": "接続する機器ごとに，重複しないIDを設定する必要がある。"
          },
          {
            "key": "エ",
            "text": "複数のデータ線をもち，転送方式がパラレル転送である。"
          }
        ],
        "text": "周辺機器との接続インタフェースであるIEEE1394とUSBの両方に共通する特徴はどれか。"
      },
      {
        "no": "問79",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "Bluetooth"
          },
          {
            "key": "イ",
            "text": "IEEE 1394"
          },
          {
            "key": "ウ",
            "text": "IrDA"
          },
          {
            "key": "エ",
            "text": "シリアルATA"
          }
        ],
        "text": "接続コードを使用せずに，手元のPCから，間仕切りで隔てられた隣のPCへ画像ファイルを転送したい。このとき，利用できるインタフェースはどれか。"
      },
      {
        "no": "問80",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "１台のホストは最大127台のデバイスに接続することができる。"
          },
          {
            "key": "イ",
            "text": "規格では，1,000ｍ以上離れた場所でも通信可能であると定められている。"
          },
          {
            "key": "ウ",
            "text": "通信方向に指向性があるので，接続対象の機器同士を向かい合わせて通信を行う。"
          },
          {
            "key": "エ",
            "text": "免許不要の 2.4GHz 帯の電波を利用して通信する。"
          }
        ],
        "text": "Bluetooth の説明として，適切なものはどれか。"
      },
      {
        "no": "問81",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "IEEE 1394"
          },
          {
            "key": "イ",
            "text": "IrDA"
          },
          {
            "key": "ウ",
            "text": "PIAFS"
          },
          {
            "key": "エ",
            "text": "RS-232C"
          }
        ],
        "text": "携帯電話同士でアドレス帳などのデータ交換を行う場合に使用される，赤外線を用いるデータ転送の規格はどれか。"
      },
      {
        "no": "問82",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "PCに接続された周辺機器を制御するソフトウェア"
          },
          {
            "key": "イ",
            "text": "アプリケーションプログラムをPCに導入するソフトウェア"
          },
          {
            "key": "ウ",
            "text": "キーボードなどの操作手順を登録して，その操作を自動化するソフトウェア"
          },
          {
            "key": "エ",
            "text": "他のPCに入り込んで不利益をもたらすソフトウェア"
          }
        ],
        "text": "デバイスドライバの説明として，適切なものはどれか。"
      },
      {
        "no": "問83",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "アプリケーションプログラムの要求に従って，ハードウェアを直接制御する。"
          },
          {
            "key": "イ",
            "text": "実行を待っているタスクの中から，次に実行するタスクを決定する。"
          },
          {
            "key": "ウ",
            "text": "複数のウインドウの，画面上での表示状態を管理する。"
          },
          {
            "key": "エ",
            "text": "利用者が入力するコマンド文字列を解釈して，対応するプログラムを起動する。"
          }
        ],
        "text": "デバイスドライバの役割として，適切なものはどれか。"
      },
      {
        "no": "問84",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "CPUが入出力装置を直接制御することによって，データ転送が行われる。"
          },
          {
            "key": "イ",
            "text": "CPUを介さずに入出力装置と主記憶装置の間のデータ転送が行われる。"
          },
          {
            "key": "ウ",
            "text": "チャネル接続によって入出力装置と主記憶装置の間のデータ転送が行われる。"
          },
          {
            "key": "エ",
            "text": "入出力制御専用のプロセッサによってデータ転送が行われる。"
          }
        ],
        "text": "DMA制御方式における入出力処理の記述として，最も適切なものはどれか。"
      },
      {
        "no": "問85",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "タッチすることによって，赤外線ビームが遮られて起こる赤外線反射の変化を捉えて位置を検出する。"
          },
          {
            "key": "イ",
            "text": "タッチパネルの表面に電界が形成され，タッチした部分の表面電荷の変化を捉えて位置を検出する。"
          },
          {
            "key": "ウ",
            "text": "抵抗膜に電圧を加え，タッチした部分の抵抗値の変化を捉えて位置を検出する。"
          },
          {
            "key": "エ",
            "text": "マトリックス状に電極スイッチが並んでおり，押された部分の電極で位置を検出する。"
          }
        ],
        "text": "静電容量方式タッチパネルの記述として，適切なものはどれか。"
      },
      {
        "no": "問86",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "OCR"
          },
          {
            "key": "イ",
            "text": "OMR"
          },
          {
            "key": "ウ",
            "text": "イメージスキャナ"
          },
          {
            "key": "エ",
            "text": "タブレット"
          }
        ],
        "text": "入力装置の中で，ポインティングデバイスに分類され，CADシステムの図形入力などに使用されるものはどれか。"
      },
      {
        "no": "問87",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "電極の間に電気を通すと発光する特殊な有機化合物を挟んだ構造のディスプレイである。"
          },
          {
            "key": "イ",
            "text": "電子銃から発射された電子ビームが蛍光体に当たり発光することを利用するディスプレイである。"
          },
          {
            "key": "ウ",
            "text": "光の透過を画素ごとに制御し，カラーフィルタを用いて色を表現するディスプレイである。"
          },
          {
            "key": "エ",
            "text": "放電によって発生する紫外線と蛍光体を利用するディスプレイである。"
          }
        ],
        "text": "液晶ディスプレイの説明として，適切なものはどれか。"
      },
      {
        "no": "問88",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "視野角が狭い"
          },
          {
            "key": "イ",
            "text": "寿命が長い"
          },
          {
            "key": "ウ",
            "text": "発熱が少ない"
          },
          {
            "key": "エ",
            "text": "自ら発光する"
          }
        ],
        "text": "液晶ディスプレイと比較した場合，有機ELディスプレイの特徴として，適切なものはどれか。"
      },
      {
        "no": "問89",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "インクジェットプリンタを用いれば，カーボン複写の控えを取ることができる。"
          },
          {
            "key": "イ",
            "text": "ドットインパクトプリンタは，漢字や図形の印刷ができない。"
          },
          {
            "key": "ウ",
            "text": "熱転写プリンタは，カラー印刷ができない。"
          },
          {
            "key": "エ",
            "text": "レーザプリンタは，図形や画像も印刷できる。"
          }
        ],
        "text": "プリンタに関する記述のうち，適切なものはどれか。"
      },
      {
        "no": "問90",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "高温の印字ヘッドのピンを感熱紙に押し付けることによって印刷を行う。"
          },
          {
            "key": "イ",
            "text": "コンピュータグラフィックスを建物，家具など凹凸のある立体物に投影する。"
          },
          {
            "key": "ウ",
            "text": "熱溶解積層方式などによって，立体物を造形する。"
          },
          {
            "key": "エ",
            "text": "立体物の形状を感知して，3Dデータとして出力する。"
          }
        ],
        "text": "3Dプリンタの機能の説明として，適切なものはどれか。"
      },
      {
        "no": "問91",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "1インチ(2.54cm)当たりのドット数と1分間に印刷できるページ数"
          },
          {
            "key": "イ",
            "text": "1文字を印字するのに使われる縦横のドット数と1秒間に印字できる文字数"
          },
          {
            "key": "ウ",
            "text": "印字する行の間隔と1秒間に印字できる行数"
          },
          {
            "key": "エ",
            "text": "印字する文字の種類と1秒間に印字できる文字数"
          }
        ],
        "text": "レーザプリンタの性能を表す指標として，最も適切なものはどれか。"
      },
      {
        "no": "問92",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "１／４"
          },
          {
            "key": "イ",
            "text": "１／２"
          },
          {
            "key": "ウ",
            "text": "２"
          },
          {
            "key": "エ",
            "text": "４"
          }
        ],
        "text": "解像度600dpiのスキャナで画像を読み込み，解像度300dpiのプリンタで印刷すると，印刷される画像の面積は元の画像の何倍になるか。"
      },
      {
        "no": "問93",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "０．８"
          },
          {
            "key": "イ",
            "text": "２．４"
          },
          {
            "key": "ウ",
            "text": "６．３"
          },
          {
            "key": "エ",
            "text": "１８．９"
          }
        ],
        "text": "１ピクセル当たり24ビットのカラー情報をビデオメモリに記憶する場合，横1,024 ピクセル，縦 768 ピクセルの画面表示に必要となるメモリ量は，約何Mバイトか。"
      },
      {
        "no": "問94",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "300 k"
          },
          {
            "key": "イ",
            "text": "1 M"
          },
          {
            "key": "ウ",
            "text": "550 M"
          },
          {
            "key": "エ",
            "text": "133 G"
          }
        ],
        "text": "画面の大きさが横 640 ドット，縦 480 ドットで，256 色が同時に表示できるパソコンのモニタの画面全体を使って，30 フレーム／秒のカラー動画を再生表示させる。このとき，１分間に表示される画像データの量（バイト）として，最も近いものはどれか。ここで，データは圧縮しないものとする。"
      },
      {
        "no": "問95",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "１"
          },
          {
            "key": "イ",
            "text": "４"
          },
          {
            "key": "ウ",
            "text": "１１"
          },
          {
            "key": "エ",
            "text": "１５"
          }
        ],
        "text": "横1,600 ドット，縦1,200ドットで，24 ビットのカラー情報をもつ画像を撮影できるディジタルカメラがある。このカメラに８Mバイトの記録用メモリを使用すると，何枚の画像を記録できるか。ここで，画像は圧縮しないものとする。"
      },
      {
        "no": "問96",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "０．２７"
          },
          {
            "key": "イ",
            "text": "１６２"
          },
          {
            "key": "ウ",
            "text": "１，０４５"
          },
          {
            "key": "エ",
            "text": "１，２９６"
          }
        ],
        "text": "横 25.4 cm，縦 38.1 cmの画像を，解像度 600 dpi，24 ビットの色情報を指定してスキャナで読み込むと，データ量は約何 M バイトになるか。ここで，１インチは 2.54 cmとする。"
      },
      {
        "no": "問97",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "８"
          },
          {
            "key": "イ",
            "text": "９"
          },
          {
            "key": "ウ",
            "text": "１２"
          },
          {
            "key": "エ",
            "text": "１６"
          }
        ],
        "text": "96dpi のディスプレイに 12 ポイントの文字をビットマップで表示したい。 正方フォントの縦は何ドットになるか。ここで，１ポイントは１／72 インチとする。"
      },
      {
        "no": "問98",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "CMOS"
          },
          {
            "key": "イ",
            "text": "DRAM"
          },
          {
            "key": "ウ",
            "text": "ECL"
          },
          {
            "key": "エ",
            "text": "TTL"
          }
        ],
        "text": "素子の動作は比較的遅いが，集積度を高めることが可能なので，プロセッサや周辺の回路を1個のチップに搭載した大規模LSIを安価に製造でき，プロセッサの主流として広く使用されている半導体はどれか。"
      },
      {
        "no": "問99",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "CPU，チップセット，ビデオチップ，メモリなどコンピュータを構成するための電子回路基板"
          },
          {
            "key": "イ",
            "text": "CPU，メモリ，周辺装置などの間で発生するデータの受渡しを管理する一連の回路群を搭載した半導体チップ"
          },
          {
            "key": "ウ",
            "text": "必要とされるすべての機能(システム)を同一プロセスで集積した半導体チップ"
          },
          {
            "key": "エ",
            "text": "プロセスが異なる機能は，個別に最適化されたプロセスで製造し，パッケージ上でそれぞれのチップを適切に配線した半導体チップ"
          }
        ],
        "text": "SoC（System on a Chip）の説明として，適切なものはどれか。"
      },
      {
        "no": "問100",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "PCのメインCPUに適している。"
          },
          {
            "key": "イ",
            "text": "ROMは内蔵されているが，RAMは内蔵されていない。"
          },
          {
            "key": "ウ",
            "text": "高速処理システム又は大規模なシステムに適している。"
          },
          {
            "key": "エ",
            "text": "入出力機能が内蔵されている。"
          }
        ],
        "text": "シングルチップマイコンの特徴として，最も適切なものはどれか。"
      },
      {
        "no": "問101",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "交流から直流への変換，直流から交流への変換で生じる電力損失を低減できる。"
          },
          {
            "key": "イ",
            "text": "受電設備からCPUなどのLSIまで，同じ電圧のまま給電できる。"
          },
          {
            "key": "ウ",
            "text": "停電の危険がないので，電源バックアップ用のバッテリを不要にできる。"
          },
          {
            "key": "エ",
            "text": "トランスを用いて容易に昇圧，降圧ができる。"
          }
        ],
        "text": "データセンタなどで採用されているサーバ，ネットワーク機器に対する直流給電の利点として，適切なものはどれか。"
      },
      {
        "no": "問102",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "1,000"
          },
          {
            "key": "イ",
            "text": "1,200"
          },
          {
            "key": "ウ",
            "text": "1,500"
          },
          {
            "key": "エ",
            "text": "2,000"
          }
        ],
        "text": "家庭用の100V電源で動作し，運転中に10Aの電流が流れる機器を，図のとおりに0分から120分まで運転した。このとき消費する電力量は何Whか。ここで，電圧及び電流の値は実効値であり，停止時に電流は流れないものとする。また，力率は1とする。",
        "figure": "<div class=\"securityFigure\"><img src=\"assets/hardware/figure-03.png\" alt=\"問題図\" loading=\"lazy\"></div>"
      },
      {
        "no": "問103",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "2.5/128"
          },
          {
            "key": "イ",
            "text": "2.5/255"
          },
          {
            "key": "ウ",
            "text": "2.5/256"
          },
          {
            "key": "エ",
            "text": "2.5/512"
          }
        ],
        "text": "分解能が8ビットのD/A変換器に，ディジタル値0を入力したときの出力電圧が0Vとなり，ディジタル値128を入力したときの出力電圧が2.5Vとなるとき，最下位の1ビットの変化によるこのD/A変換器の出力電圧の変化は何Vか。"
      },
      {
        "no": "問104",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "アナログ電気信号を，コンピュータが処理可能なディジタル信号に変える。"
          },
          {
            "key": "イ",
            "text": "キーボード，タッチパネルなどに使用され，コンピュータに情報を入力する。"
          },
          {
            "key": "ウ",
            "text": "コンピュータが出力した電気信号を力学的な運動に変える。"
          },
          {
            "key": "エ",
            "text": "物理量を検出して，電気信号に変える。"
          }
        ],
        "text": "アクチュエータの機能として，適切なものはどれか。"
      },
      {
        "no": "問105",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "サーミスタ"
          },
          {
            "key": "イ",
            "text": "ジャイロ"
          },
          {
            "key": "ウ",
            "text": "ひずみゲージ"
          },
          {
            "key": "エ",
            "text": "ホール素子"
          }
        ],
        "text": "変形を感知するセンサーを用いると，高架道路などの状態を監視してメンテナンスすることが可能である。この目的で使用されているセンサーはどれか。"
      },
      {
        "no": "問106",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "ア"
          },
          {
            "key": "イ",
            "text": "イ"
          },
          {
            "key": "ウ",
            "text": "ウ"
          },
          {
            "key": "エ",
            "text": "エ"
          }
        ],
        "text": "7セグメントLED点灯回路で，出力ポートに16進数で6Dを出力したときの 表示状態はどれか。ここで，P7を最上位ビット(MSB)，P0を最下位ビット(LSB)とし， ポート出力が1のとき，LEDは点灯する。",
        "figure": "<div class=\"securityFigure\"><img src=\"assets/hardware/figure-08.png\" alt=\"問題図\" loading=\"lazy\"><div class=\"imageChoiceGrid\"><div><b>ア</b><img src=\"assets/hardware/figure-12.png\" alt=\"選択肢ア\" loading=\"lazy\"></div><div><b>イ</b><img src=\"assets/hardware/figure-09.png\" alt=\"選択肢イ\" loading=\"lazy\"></div><div><b>ウ</b><img src=\"assets/hardware/figure-06.png\" alt=\"選択肢ウ\" loading=\"lazy\"></div><div><b>エ</b><img src=\"assets/hardware/figure-10.png\" alt=\"選択肢エ\" loading=\"lazy\"></div></div></div>"
      },
      {
        "no": "問107",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "サンプリング"
          },
          {
            "key": "イ",
            "text": "シェアリング"
          },
          {
            "key": "ウ",
            "text": "チャタリング"
          },
          {
            "key": "エ",
            "text": "バッファリング"
          }
        ],
        "text": "機械式接点の押しボタンスイッチを1回押すことに対して，押してから数ミリ秒の間，複数回のON，OFFが発生する現象はどれか。"
      },
      {
        "no": "問108",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "ア"
          },
          {
            "key": "イ",
            "text": "イ"
          },
          {
            "key": "ウ",
            "text": "ウ"
          },
          {
            "key": "エ",
            "text": "エ"
          }
        ],
        "text": "図のような黒色で描かれた円に沿って車が走るように，左右の後輪に独立に取り付けられたモータL及びRの回転速度を制御する。センサL及びRは反射型光センサであり，センサが黒色に掛かる比率が大きいと出力値が小さくなり，黒色に掛かる比率が小さいと出力値が大きくなる。この車を円に沿って走行させるためのモータ回転速度の制御方法として，適切なものはどれか。ここで，二つのセンサの出力値が一致するときには，二つのモータの回転速度を初期値に戻すものとする。",
        "figure": "<div class=\"securityFigure\"><img src=\"assets/hardware/figure-14.png\" alt=\"問題図\" loading=\"lazy\"></div>"
      },
      {
        "no": "問109",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "アルカリマンガン乾電池"
          },
          {
            "key": "イ",
            "text": "酸化銀電池"
          },
          {
            "key": "ウ",
            "text": "燃料電池"
          },
          {
            "key": "エ",
            "text": "リチウムイオン電池"
          }
        ],
        "text": "二次電池(充電式電池)はどれか。"
      },
      {
        "no": "問110",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "あらかじめ定められた順序又は条件に従って，制御の各段階を逐次進めていく制御方法である。"
          },
          {
            "key": "イ",
            "text": "外乱が予測できる場合に，あらかじめ外乱を想定して前もって必要な修正動作を行う制御方法である。"
          },
          {
            "key": "ウ",
            "text": "制御量を常に検出して制御に反映しているので，予測できないような外乱に強い制御方法である。"
          },
          {
            "key": "エ",
            "text": "“やや多い”，“やや少ない”などあいまい性に基づく制御方法である。"
          }
        ],
        "text": "産業機器の機器制御に使われるシーケンス制御の説明として，適切なものはどれか。"
      },
      {
        "no": "問111",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "あらかじめ定められた順序で制御を行う。"
          },
          {
            "key": "イ",
            "text": "外乱の影響が出力に現れる前に制御を行う。"
          },
          {
            "key": "ウ",
            "text": "出力結果と目標値を比較して，一致するように制御を行う。"
          },
          {
            "key": "エ",
            "text": "出力結果を使用せず制御を行う。"
          }
        ],
        "text": "フィードバック制御の説明として，適切なものはどれか。"
      },
      {
        "no": "問112",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "サイトマップ"
          },
          {
            "key": "イ",
            "text": "ナビゲーションバー"
          },
          {
            "key": "ウ",
            "text": "スクロールバー"
          },
          {
            "key": "エ",
            "text": "パンくずリスト"
          }
        ],
        "text": "利用者が現在閲覧しているWebページに表示する，Webサイトのトップページからそのページまでの経路情報を何と呼ぶか。"
      },
      {
        "no": "問113",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "回顧法"
          },
          {
            "key": "イ",
            "text": "思考発話法"
          },
          {
            "key": "ウ",
            "text": "認知的ウォークスルー法"
          },
          {
            "key": "エ",
            "text": "ヒューリスティック評価法"
          }
        ],
        "text": "一般に専門家が，様々なユーザインタフェース設計によく当てはまる経験則を基にして，インタフェースを評価する方法はどれか。"
      },
      {
        "no": "問114",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "誤操作した利用者の操作記録をとり，インタビューして問題点を解析する。"
          },
          {
            "key": "イ",
            "text": "誤操作は慣れていないために起きることなので，利用者の習熟度を調べる。"
          },
          {
            "key": "ウ",
            "text": "入力画面を設計した人にインタビューして，問題点を明らかにする。"
          },
          {
            "key": "エ",
            "text": "プログラム設計書を調査して，設計上の無理がないか分析する。"
          }
        ],
        "text": "ある業務用に開発した入力画面で，多くの利用者が誤操作していることが分かった。始めに実施する対策として適切なものはどれか。"
      },
      {
        "no": "問115",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "CG映像作成における最終段階として，物体のデータをディスプレイに描画できるように映像化する処理である。"
          },
          {
            "key": "イ",
            "text": "画像表示領域にウィンドウを定義し，ウィンドウの外側を除去し，内側の見える部分だけを取り出す処理である。"
          },
          {
            "key": "ウ",
            "text": "スクリーンの画素数が有限なので図形の境界近くに生じる，階段状のギザギザを目立たなくする処理である。"
          },
          {
            "key": "エ",
            "text": "立体感を生じさせるため，物体の表面に陰付けを行う処理である。"
          }
        ],
        "text": "3次元グラフィックス処理におけるクリッピングの説明はどれか。"
      },
      {
        "no": "問116",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "英数字だけでなく，漢字も表示する。"
          },
          {
            "key": "イ",
            "text": "各文字の幅を一定にして表示する。"
          },
          {
            "key": "ウ",
            "text": "画面上にできるだけ高速に表示する。"
          },
          {
            "key": "エ",
            "text": "文字を任意の倍率で拡大して表示する。"
          }
        ],
        "text": "ビットマップフォントよりも，アウトラインフォントの利用が適しているケースはどれか。"
      },
      {
        "no": "問117",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "光源からの反射や屈折，透過を計算し描画していく。"
          },
          {
            "key": "イ",
            "text": "光源と物体の形状などに基づいて，表示するときに陰影をつける。"
          },
          {
            "key": "ウ",
            "text": "表示画面からはみ出す箇所をあらかじめ見つけ，表示対象から外す。"
          },
          {
            "key": "エ",
            "text": "物体の表面に画像を貼り付けることによって，表面の質感を表現する。"
          }
        ],
        "text": "テクスチャマッピングを説明したものはどれか。"
      },
      {
        "no": "問118",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "キーフレーム法"
          },
          {
            "key": "イ",
            "text": "ピクセルシェーダ"
          },
          {
            "key": "ウ",
            "text": "モーションキャプチャ"
          },
          {
            "key": "エ",
            "text": "モーフィング"
          }
        ],
        "text": "アニメーションの作成過程で，センサやビデオカメラなどを用いて人間や動物の自然な動きを取り込む技法はどれか。"
      },
      {
        "no": "問119",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "画像A，Bを対象として，AからBへ滑らかに変化していく様子を表現するために，その中間を補うための画像を複数作成する。"
          },
          {
            "key": "イ",
            "text": "実際の身体の動きをディジタルデータとして収集して，これを基にリアルな動きをもつ画像を複数作成する。"
          },
          {
            "key": "ウ",
            "text": "背景とは別に，動きがある部分を視点から遠い順に重ねて画像を作成することによって，奥行きが感じられる2次元アニメーションを生成する。"
          },
          {
            "key": "エ",
            "text": "人手によって描かれた線画をスキャナで読み取り，その閉領域を同一色で彩色処理する。"
          }
        ],
        "text": "コンピュータアニメーション技法のうち，モーフィングの説明はどれか。"
      },
      {
        "no": "問120",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "ある物体Aを含む映像aから他の形状の異なる物体Bを含む映像bへ,滑らかに変化する映像"
          },
          {
            "key": "イ",
            "text": "コンピュータ内部に記録されているモデルを,ディスプレイに描画できるように2次元化した映像"
          },
          {
            "key": "ウ",
            "text": "閉じた立体となる多面体を構成したり,2次曲面や自由曲面を近似するのに用いられたりする基本的な要素"
          },
          {
            "key": "エ",
            "text": "モデリングされた物体の表面に貼り付ける柄や模様などの画像"
          }
        ],
        "text": "3次元コンピュータグラフィクスに関する記述のうち，ポリゴンの説明はどれか。"
      },
      {
        "no": "問121",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "関連する複数の静止画を入力すると，静止画間の差分を順に変化させながら表示していくことで，簡易な動画のように表現することができる。"
          },
          {
            "key": "イ",
            "text": "図形や線などを部品として，始点，方向，長さの要素によって描画していく。また，これらの部品の変形や組合せで効率的に図形を描画していくことができる。"
          },
          {
            "key": "ウ",
            "text": "マウスを使ってカーソルを筆先のように動かして，画面上に絵を描いていく。出来上がった絵はビットマップ画像として保管することができる。"
          },
          {
            "key": "エ",
            "text": "文字や静止画データ，動画データ，音声データなど複数の素材をシナリオに沿って編集，配置し，コンテンツに仕上げることができる。"
          }
        ],
        "text": "ドローソフトを説明したものはどれか。"
      },
      {
        "no": "問122",
        "answer": "ア",
        "choices": [
          {
            "key": "ア",
            "text": "アンチエイリアシング"
          },
          {
            "key": "イ",
            "text": "クリッピング"
          },
          {
            "key": "ウ",
            "text": "シェーディング"
          },
          {
            "key": "エ",
            "text": "モーフィング"
          }
        ],
        "text": "コンピュータグラフィックスで図形を描画する際に，図形の境界近くの画素に変化する色彩の中間色を割り当てることで，境界に生じる階段状のギザギザを目立たなくする技術はどれか。"
      },
      {
        "no": "問123",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "JPEG"
          },
          {
            "key": "イ",
            "text": "MPEG-1"
          },
          {
            "key": "ウ",
            "text": "MPEG-2"
          },
          {
            "key": "エ",
            "text": "MPEG-4"
          }
        ],
        "text": "次の画像符号化方式のうち，携帯電話などの低速回線用の動画像の符号化に用いられるものはどれか。"
      },
      {
        "no": "問124",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "源の位置と対象物体への光の当たり具合とを解析し，どのような色・明るさで見えるのかを決定する"
          },
          {
            "key": "イ",
            "text": "指定された視点から見える部分だけを描くようにする。"
          },
          {
            "key": "ウ",
            "text": "生成された画像について，表示する画面に収まる部分だけを表示する。"
          },
          {
            "key": "エ",
            "text": "物体の表面だけでなく物体の内部や背後に隠れた部分の形状も，半透明表示などによって画像として生成する。"
          }
        ],
        "text": "3次元CGのレンダリングにおける，隠線消去及び隠面消去の説明はどれか。"
      },
      {
        "no": "問125",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "インターネットで動画や音声データのストリーミング配信を制御するための通信方式"
          },
          {
            "key": "イ",
            "text": "携帯電話で使用されている音声圧縮技術"
          },
          {
            "key": "ウ",
            "text": "テレビの電子番組案内で使用される番組内容のメタデータを記述する方式"
          },
          {
            "key": "エ",
            "text": "ワンセグやインターネットで用いられる動画データの圧縮符号化方式"
          }
        ],
        "text": "H.264/MPEG-4 AVCに関する記述はどれか。"
      },
      {
        "no": "問126",
        "answer": "ウ",
        "choices": [
          {
            "key": "ア",
            "text": "OR回路"
          },
          {
            "key": "イ",
            "text": "AND回路"
          },
          {
            "key": "ウ",
            "text": "XOR回路"
          },
          {
            "key": "エ",
            "text": "NOR回路"
          }
        ],
        "text": "図の論理回路と等価な回路はどれか。",
        "figure": "<div class=\"securityFigure\"><img src=\"assets/hardware/figure-15.png\" alt=\"問題の論理回路\" loading=\"lazy\"><div class=\"imageChoiceGrid\"><div><b>ア</b><img src=\"assets/hardware/figure-16.png\" alt=\"選択肢アの論理回路\" loading=\"lazy\"></div><div><b>イ</b><img src=\"assets/hardware/figure-17.png\" alt=\"選択肢イの論理回路\" loading=\"lazy\"></div><div><b>ウ</b><img src=\"assets/hardware/figure-18.png\" alt=\"選択肢ウの論理回路\" loading=\"lazy\"></div><div><b>エ</b><img src=\"assets/hardware/figure-19.png\" alt=\"選択肢エの論理回路\" loading=\"lazy\"></div></div></div>"
      },
      {
        "no": "問127",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "AND回路"
          },
          {
            "key": "イ",
            "text": "NAND回路"
          },
          {
            "key": "ウ",
            "text": "OR回路"
          },
          {
            "key": "エ",
            "text": "NOR回路"
          }
        ],
        "text": "次の論理式と同じ結果が得られる論理回路はどれか。",
        "figure": "<div class=\"securityFigure\"><img src=\"assets/hardware/figure-20.png\" alt=\"問題の論理式\" loading=\"lazy\"><div class=\"imageChoiceGrid\"><div><b>ア</b><img src=\"assets/hardware/figure-21.png\" alt=\"選択肢アの論理回路\" loading=\"lazy\"></div><div><b>イ</b><img src=\"assets/hardware/figure-22.png\" alt=\"選択肢イの論理回路\" loading=\"lazy\"></div><div><b>ウ</b><img src=\"assets/hardware/figure-23.png\" alt=\"選択肢ウの論理回路\" loading=\"lazy\"></div><div><b>エ</b><img src=\"assets/hardware/figure-24.png\" alt=\"選択肢エの論理回路\" loading=\"lazy\"></div></div></div>"
      },
      {
        "no": "問128",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "AND回路"
          },
          {
            "key": "イ",
            "text": "NAND回路"
          },
          {
            "key": "ウ",
            "text": "OR回路"
          },
          {
            "key": "エ",
            "text": "XOR回路"
          }
        ],
        "text": "二つの入力と一つの出力をもつ論理回路で，二つの入力A，Bがともに1のときだけ，出力Xが0になるものはどれか。"
      },
      {
        "no": "問129",
        "answer": "イ",
        "choices": [
          {
            "key": "ア",
            "text": "X・Y"
          },
          {
            "key": "イ",
            "text": "X＋Y"
          },
          {
            "key": "ウ",
            "text": "¬(X・Y)"
          },
          {
            "key": "エ",
            "text": "¬(X＋Y)"
          }
        ],
        "text": "NAND素子を用いた次の組合せ回路の出力Zを表す式はどれか。",
        "figure": "<div class=\"securityFigure\"><img src=\"assets/hardware/figure-25.png\" alt=\"問題文の論理記号の説明\" loading=\"lazy\"><img src=\"assets/hardware/figure-26.png\" alt=\"NAND素子を用いた組合せ回路\" loading=\"lazy\"></div>"
      },
      {
        "no": "問130",
        "answer": "エ",
        "choices": [
          {
            "key": "ア",
            "text": "AND"
          },
          {
            "key": "イ",
            "text": "NAND"
          },
          {
            "key": "ウ",
            "text": "NOR"
          },
          {
            "key": "エ",
            "text": "XOR"
          }
        ],
        "text": "次の条件を満足する論理回路はどれか。［条件］階段の上下にあるスイッチA，Bで，一つの照明を点灯，消灯する。すなわち，一方のスイッチの状態にかかわらず，他方のスイッチで照明を点灯，消灯できる。また，一方で点灯した照明を他方で消灯できる。"
      }
    ]
  }
];
